app/views/users/show.html.erb

SELECT  "accounts".* FROM "accounts" ORDER BY "accounts"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT COUNT(*) FROM "accounts"
SELECT  1 AS one FROM "accounts" WHERE "accounts"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
---
<h3><%=link_to "Sign Out", new_user_path %></h3>
<h2>Your remaining budget is currently at $<%= number_with_precision (@user.total_funds - @user.accounts.map(&:spent_funds).inject(0, &:+)), :precision => 2 %></h2>
<% if @user.accounts.any? %>