app/controllers/accounts_controller.rb

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "accounts" SET "spent_funds" = $1, "remaining_funds" = $2, "updated_at" = $3 WHERE "accounts"."id" = $4  [["spent_funds", #<BigDecimal:7ffef10a0490,'0.1E2',9(18)>], ["remaining_funds", #<BigDecimal:7ffef10a0350,'0.9E2',9(18)>], ["updated_at", 2016-10-20 02:33:16 UTC], ["id", 49]]
---
  def update
    @account = Account.find(params[:account_id])
    @account.spent_funds += params[:Account].to_f
    @account.remaining_funds -= params[:Account].to_f
    @account.save