app/controllers/users_controller.rb

INSERT INTO "users" ("total_funds", "email", "encrypted_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.create!(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
INSERT INTO "accounts" ("user_id", "name", "remaining_funds", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["name", "Transportation"], ["remaining_funds", 1], ["created_at", 2016-10-19 21:30:32 UTC], ["updated_at", 2016-10-19 21:30:32 UTC]]
---
  def update
    @user = User.find(params[:user_id])
    @user.accounts << Account.create(remaining_funds: params[:Transportation], spent_funds: 0, name: 'Transportation')